20250213T222855--kdoc-341-quick-overview-of-go124__wiki.org
:properties:
:ID: 20250213T222855
:mtime:    20250428165214
:ctime:    20250213222855
:end:
#+title:      KDOC 341: Quick overview of Go1.24
#+date:       [2025-02-13 Thu 22:28]
#+filetags:   :wiki:
#+identifier: 20250213T222855

* この文書のステータス
- 作成
  - [X] 2025-02-14 貴島
- レビュー
  - [X] 2025-02-19 貴島

* 概要

リリースされたので重要な変更だけ一読した。

- ブログ: [[https://go.dev/blog/go1.24][Go 1.24 is released! - The Go Programming Language]]
- リリースノート: [[https://go.dev/blog/go1.24][Go 1.24 is released! - The Go Programming Language]]

メモ。

- パフォーマンス改善
- go vetにtestアナライザが追加された。テストにまつわるありがちなミスを報告する
- FIPS 140-3に準拠して動作できるようになった。デフォルトではオフ
  - 暗号に関する規格。米国政府の調達基準
  - [[https://go.dev/doc/security/fips140][FIPS 140-3 準拠 - Go プログラミング言語]]
- os.Root型の追加。単一のディレクトリツリーのアクセスに限定させるのに使う
  - ディレクトリの外に出るのを制限する
  - OSによって異なる挙動
- ランタイムがfinalization mechanismを提供する
  - [[https://qiita.com/umisama/items/c73aaa7fc6f50b4c3cd4][golangでデストラクタ的なことをする #Go - Qiita]]
  - GCに回収されるとき紐付けられたfinalizerが呼ばれる
  - [[https://pkg.go.dev/runtime#SetFinalizer][runtime package - runtime - Go Packages]]
  - 追加されたAddCleanupは従来のSetFinalizerよりエラーが少ない、とのこと
- ~go:wasmexport directive~ が追加された
  - 関数をエクスポートする

率直に言って、よくわからない。あまり普段使えそうな機能はなさそうである。

* 関連
なし。
