20250213T222855--kdoc-341-quick-overview-of-go124__wiki.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-27T23:10:55Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 341: Quick overview of Go1.24</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 341: Quick overview of Go1.24</h1>
<div id="outline-container-org4e949b0" class="outline-2">
<h2 id="org4e949b0"><a href="#org4e949b0">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org4e949b0">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-02-14 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-02-19 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgcb20d8c" class="outline-2">
<h2 id="orgcb20d8c"><a href="#orgcb20d8c">概要</a></h2>
<div class="outline-text-2" id="text-orgcb20d8c">
<p>
リリースされたので重要な変更だけ一読した。
</p>

<ul class="org-ul">
<li>ブログ: <a href="https://go.dev/blog/go1.24">Go 1.24 is released! - The Go Programming Language</a></li>
<li>リリースノート: <a href="https://go.dev/blog/go1.24">Go 1.24 is released! - The Go Programming Language</a></li>
</ul>

<p>
メモ。
</p>

<ul class="org-ul">
<li>パフォーマンス改善</li>
<li>go vetにtestアナライザが追加された。テストにまつわるありがちなミスを報告する</li>
<li>FIPS 140-3に準拠して動作できるようになった。デフォルトではオフ
<ul class="org-ul">
<li>暗号に関する規格。米国政府の調達基準</li>
<li><a href="https://go.dev/doc/security/fips140">FIPS 140-3 準拠 - Go プログラミング言語</a></li>
</ul></li>
<li>os.Root型の追加。単一のディレクトリツリーのアクセスに限定させるのに使う
<ul class="org-ul">
<li>ディレクトリの外に出るのを制限する</li>
<li>OSによって異なる挙動</li>
</ul></li>
<li>ランタイムがfinalization mechanismを提供する
<ul class="org-ul">
<li><a href="https://qiita.com/umisama/items/c73aaa7fc6f50b4c3cd4">golangでデストラクタ的なことをする #Go - Qiita</a></li>
<li>GCに回収されるとき紐付けられたfinalizerが呼ばれる</li>
<li><a href="https://pkg.go.dev/runtime#SetFinalizer">runtime package - runtime - Go Packages</a></li>
<li>追加されたAddCleanupは従来のSetFinalizerよりエラーが少ない、とのこと</li>
</ul></li>
<li><code>go:wasmexport directive</code> が追加された
<ul class="org-ul">
<li>関数をエクスポートする</li>
</ul></li>
</ul>

<p>
率直に言って、よくわからない。あまり普段使えそうな機能はなさそうである。
</p>
</div>
</div>
<div id="outline-container-org64ab0b6" class="outline-2">
<h2 id="org64ab0b6"><a href="#org64ab0b6">関連</a></h2>
<div class="outline-text-2" id="text-org64ab0b6">
<p>
なし。
</p>
</div>
</div>
<div id="outline-container-org9d7b850" class="outline-2">
<h2 id="org9d7b850"><a href="#org9d7b850">Backlinks</a></h2>
<div class="outline-text-2" id="text-org9d7b850">
<ul class="org-ul">
<li><a href="./20250213T230129--kdoc-342-リリースを調べる効用を感じた__essay.html">KDOC 342: リリースを調べる効用を感じた</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
